In [1]:
import pandas as p
import numpy as n
import matplotlib.pyplot as plt
import seaborn as s
import sklearn
from sklearn import model_selection
from sklearn  import ensemble
from sklearn import linear_model
from sklearn import naive_bayes
from sklearn import discriminant_analysis
from sklearn import feature_extraction
from sklearn import feature_selection
from sklearn import metrics
from sklearn.linear_model import LogisticRegression
from sklearn.ensemble import RandomForestClassifier
from sklearn.tree import DecisionTreeClassifier
from scipy.sparse import csr_matrix
import warnings
from sklearn.neighbors import NearestNeighbors

In [2]:
rt=p.read_csv("https://s3-us-west-2.amazonaws.com/recommender-tutorial/ratings.csv")

In [3]:
rt.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [4]:
rt.tail()

        userId  movieId  rating   timestamp
100831     610   166534     4.0  1493848402
100832     610   168248     5.0  1493850091
100833     610   168250     5.0  1494273047
100834     610   168252     5.0  1493846352
100835     610   170875     3.0  1493846415

In [5]:
rt.shape

(100836, 4)

In [6]:
rt.size

403344

In [7]:
rt.columns

Index(['userId', 'movieId', 'rating', 'timestamp'], dtype='object')

In [8]:
rt.count()

userId       100836
movieId      100836
rating       100836
timestamp    100836
dtype: int64

In [9]:
rt.value_counts()

userId  movieId  rating  timestamp
1       1        4.0     964982703     1
434     4993     5.0     1270604133    1
        4963     4.0     1270604560    1
        4896     2.5     1270604915    1
        4886     4.5     1270604658    1
                                      ..
227     58303    4.0     1447210409    1
        56782    4.5     1447210013    1
        56367    4.5     1447210824    1
        55820    4.0     1447209881    1
610     170875   3.0     1493846415    1
Length: 100836, dtype: int64

In [10]:
rt.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100836 entries, 0 to 100835
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   userId     100836 non-null  int64
 1   movieId    100836 non-null  int64
 2   rating     100836 non-null  float64
 3   timestamp  100836 non-null  int64
dtypes: float64(1), int64(3)
memory usage: 3.1 MB

In [11]:
rt.describe()

              userId        movieId         rating     timestamp
count  100836.000000  100836.000000  100836.000000  1.008360e+05
mean      326.127564   19435.295718       3.501557  1.205946e+09
std       182.618491   35530.987199       1.042529  2.162610e+08
min         1.000000       1.000000       0.500000  8.281246e+08
25%       177.000000    1199.000000       3.000000  1.019124e+09
50%       325.000000    2991.000000       3.500000  1.186087e+09
75%       477.000000    8122.000000       4.000000  1.435994e+09
max       610.000000  193609.000000       5.000000  1.537799e+09

In [12]:
rt.isna().any()

userId       False
movieId      False
rating       False
timestamp    False
dtype: bool

In [13]:
rt.isnull().sum()

userId       0
movieId      0
rating       0
timestamp    0
dtype: int64

In [14]:
mv=p.read_csv("https://s3-us-west-2.amazonaws.com/recommender-tutorial/movies.csv")

In [15]:
mv.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [16]:
mv.tail()

,movieId,title,genres
9737,193581,Black Butler: Book of the Atlantic (2017),Action|Animation|Comedy|Fantasy
9738,193583,No Game No Life: Zero (2017),Animation|Comedy|Fantasy
9739,193585,Flint (2017),Drama
9740,193587,Bungo Stray Dogs: Dead Apple (2018),Action|Animation
9741,193609,Andrew Dice Clay: Dice Rules (1991),Comedy

In [17]:
mv.shape

(9742, 3)

In [18]:
mv.size

29226

In [19]:
mv.count()

movieId    9742
title      9742
genres     9742
dtype: int64

In [20]:
mv.value_counts()

movieId  title                                                  genres
1        Toy Story (1995)                                       Adventure|Animation|Children|Comedy|Fantasy    1
53322    Ocean's Thirteen (2007)                                Crime|Thriller                                 1
53129    Mr. Brooks (2007)                                      Crime|Drama|Thriller                           1
53138    Librarian: Return to King Solomon's Mines, The (2006)  Action|Adventure|Fantasy                       1
53140    Librarian: Quest for the Spear, The (2004)             Action|Adventure|Comedy|Fantasy|Romance        1
                                                                                                              ..
4390     Rape Me (Baise-moi) (2000)                             Crime|Drama|Thriller                           1
4392     Alice (1990)                                           Comedy|Drama|Fantasy|Romance                   1
4393     Another Woman (1988)                                   Drama                                          1
4394     Beach Blanket Bingo (1965)                             Comedy|Musical                                 1
193609   Andrew Dice Clay: Dice Rules (1991)                    Comedy                                         1
Length: 9742, dtype: int64

In [21]:
mv.isnull().sum()

movieId    0
title      0
genres     0
dtype: int64

In [22]:
mv.isna().any()

movieId    False
title      False
genres     False
dtype: bool

In [23]:
nrt=len(rt)

In [24]:
nmv=len(rt['movieId'].unique())

In [25]:
nrt

100836

In [26]:
nmv

9724

In [27]:
nur=len(rt['userId'].unique())

In [28]:
tsp=len(rt['timestamp'].unique())

In [29]:
tsp

85043

In [30]:
r=len(rt['rating'].unique())

In [31]:
r

10

In [32]:
print(f"Number of ratings: {nrt}")

Number of ratings: 100836

In [33]:
print(f"Number of unique movies: {nmv}")

Number of unique movies: 9724

In [34]:
print(f"Number of new distinctive: {nur}")

Number of new distinctive: 610

In [35]:
print(f"Number of new ratings: {r}")

Number of new ratings: 10

In [36]:
print(f"Current Timestamp: {tsp}")

Current Timestamp: 85043

In [37]:
avg=round(nrt/nur,2)

In [38]:
avg

165.3

In [39]:
print(f"Average rate/user: {avg}")

Average rate/user: 165.3

In [40]:
uf=rt[['userId', 'movieId']].groupby('userId').count().reset_index()

In [41]:
uf

     userId  movieId
0         1      232
1         2       29
2         3       39
3         4      216
4         5       44
..      ...      ...
605     606     1115
606     607      187
607     608      831
608     609       37
609     610     1302

[610 rows x 2 columns]

In [42]:
uf.columns=['userId','nrt']

In [43]:
uf.head()

   userId  nrt
0       1  232
1       2   29
2       3   39
3       4  216
4       5   44

In [44]:
mrt=rt.groupby('movieId')[['rating']].mean()

In [45]:
mrt

           rating
movieId
1        3.920930
2        3.431818
3        3.259615
4        2.357143
5        3.071429
...           ...
193581   4.000000
193583   3.500000
193585   3.500000
193587   3.500000
193609   4.000000

[9724 rows x 1 columns]

In [46]:
lrt=mrt['rating'].idxmin()

In [47]:
mv.loc[mv['movieId']==lrt]

      movieId         title   genres
2689     3604  Gypsy (1962)  Musical

In [48]:
hrt=mrt['rating'].idxmax()

In [49]:
mv.loc[mv['movieId']==hrt]

    movieId            title           genres
48       53  Lamerica (1994)  Adventure|Drama

In [50]:
rt[rt['movieId']==hrt]

       userId  movieId  rating  timestamp
13368      85       53     5.0  889468268
96115     603       53     5.0  963180003

In [51]:
rt[rt['movieId']==lrt]

       userId  movieId  rating   timestamp
13633      89     3604     0.5  1520408880

In [52]:
mst=rt.groupby('movieId')[['rating']].agg(['count','mean'])

In [53]:
mst

        rating
         count      mean
movieId
1          215  3.920930
2          110  3.431818
3           52  3.259615
4            7  2.357143
5           49  3.071429
...        ...       ...
193581       1  4.000000
193583       1  3.500000
193585       1  3.500000
193587       1  3.500000
193609       1  4.000000

[9724 rows x 2 columns]

In [54]:
mst.columns=mst.columns.droplevel()

In [55]:
mst.columns

Index(['count', 'mean'], dtype='object')

In [56]:
from scipy.sparse import csr_matrix

In [57]:
def cmt(df):
      
    S = len(df['userId'].unique())
    M = len(df['movieId'].unique())
      
    # Map Ids to indices
    up = dict(zip(n.unique(df["userId"]), list(range(S))))
    mp = dict(zip(n.unique(df["movieId"]), list(range(M))))
      
    # Map indices to IDs
    uip = dict(zip(list(range(S)), n.unique(df["userId"])))
    mip = dict(zip(list(range(M)), n.unique(df["movieId"])))
      
    ui = [up[i] for i in df['userId']]
    mi = [mp[i] for i in df['movieId']]
  
    X = csr_matrix((df["rating"], (mi, ui)), shape=(M, S))
      
    return X, up,mp, uip, mip

In [58]:
X, up,mp, uip, mip = cmt(rt)


cmt

In [59]:
def fsm(mid,X,K=10, metric='cosin',show_distance=False):
    nid=[]
    mind=mp[mid]
    simd=fsm(mid,X)
    mvec=X[mind]
    K+=1
    kNN=NearestNeighbors(n_neighbors=K, algorithm="brute",metric=metric)
    kNN.fit(X)
    mvec=mvec.reshape(1,-1)
    neighbour=kNN.kneighbors(mvec, return_distance=show_distance)
    for i in range(0,K):
        t=neighbour.item(i)
        nid.append(mip[t])
    nid.pop(0)
    simd=fsm(mid,X,K)
    for i in simd:
        print(mts[i])
    return nid

In [60]:
mts=dict(zip(mv['movieId'],mv['title']))
mid=3
mts=mts[mid]
print(f"Since you watched {mts}")

Since you watched Grumpier Old Men (1995)